Ac6Embedded/svd-microchip/PIC32CM_PL/PIC32CM3204PL10032.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>EVSYS</name>
         <version>U2256v1</version>
         <description>Event System</description>
         <baseAddress>0x42000000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xDC</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>EVSYS</name>
            <value>6</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control A</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CHSTATUS</name>
               <description>Channel Status</description>
               <addressOffset>0xC</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>USRRDY0</name>
                     <description>Users Ready on Channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USRRDY1</name>
                     <description>Users Ready on Channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USRRDY2</name>
                     <description>Users Ready on Channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USRRDY3</name>
                     <description>Users Ready on Channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHBUSY0</name>
                     <description>Channel 0 Busy</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHBUSY1</name>
                     <description>Channel 1 Busy</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHBUSY2</name>
                     <description>Channel 2 Busy</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHBUSY3</name>
                     <description>Channel 3 Busy</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x10</addressOffset>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>OVR0</name>
                     <description>Overrun Channel 0 Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR1</name>
                     <description>Overrun Channel 1 Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR2</name>
                     <description>Overrun Channel 2 Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR3</name>
                     <description>Overrun Channel 3 Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD0</name>
                     <description>Event Detected Channel 0 Interrupt Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD1</name>
                     <description>Event Detected Channel 1 Interrupt Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD2</name>
                     <description>Event Detected Channel 2 Interrupt Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD3</name>
                     <description>Event Detected Channel 3 Interrupt Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x14</addressOffset>
               <modifiedWriteValues>oneToSet</modifiedWriteValues>
               <fields>
                  <field>
                     <name>OVR0</name>
                     <description>Overrun Channel 0 Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR1</name>
                     <description>Overrun Channel 1 Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR2</name>
                     <description>Overrun Channel 2 Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR3</name>
                     <description>Overrun Channel 3 Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD0</name>
                     <description>Event Detected Channel 0 Interrupt Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD1</name>
                     <description>Event Detected Channel 1 Interrupt Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD2</name>
                     <description>Event Detected Channel 2 Interrupt Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD3</name>
                     <description>Event Detected Channel 3 Interrupt Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0x18</addressOffset>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>OVR0</name>
                     <description>Overrun Channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR1</name>
                     <description>Overrun Channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR2</name>
                     <description>Overrun Channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR3</name>
                     <description>Overrun Channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD0</name>
                     <description>Event Detected Channel 0</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD1</name>
                     <description>Event Detected Channel 1</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD2</name>
                     <description>Event Detected Channel 2</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD3</name>
                     <description>Event Detected Channel 3</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SWEVT</name>
               <description>Software Event</description>
               <addressOffset>0x1C</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CHANNEL0</name>
                     <description>Channel 0 Software Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL1</name>
                     <description>Channel 1 Software Selection</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL2</name>
                     <description>Channel 2 Software Selection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL3</name>
                     <description>Channel 3 Software Selection</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>CHANNEL[%s]</name>
               <description>Channel # Control</description>
               <addressOffset>0x20</addressOffset>
               <resetValue>0x00008000</resetValue>
               <fields>
                  <field>
                     <name>EVGEN</name>
                     <description>Event Generator</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>PATH</name>
                     <description>Path Selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>PATHSelect</name>
                        <enumeratedValue>
                           <name>SYNCHRONOUS</name>
                           <description>Synchronous path</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESYNCHRONIZED</name>
                           <description>Resynchronized path</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNCHRONOUS</name>
                           <description>Asynchronous path</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EDGSEL</name>
                     <description>Edge Detection Selection</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>EDGSELSelect</name>
                        <enumeratedValue>
                           <name>NO_EVT_OUTPUT</name>
                           <description>No event output when using the resynchronized or synchronous path</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISING_EDGE</name>
                           <description>Event detection occurs only on the rising edge of the signal from the event generator</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALLING_EDGE</name>
                           <description>Event detection occurs only on the falling edge of the signal from the event generator</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOTH_EDGES</name>
                           <description>Event detection occurs on both the rising and falling edges of the signal from the event generator</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONDEMAND</name>
                     <description>Generic Clock On Demand</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>23</dim>
               <dimIncrement>4</dimIncrement>
               <name>USER[%s]</name>
               <description>User # Channel Selection</description>
               <addressOffset>0x80</addressOffset>
               <fields>
                  <field>
                     <name>CHANNEL</name>
                     <description>Channel Event Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CHANNELSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>The Event System user is not connected to any channel</description>
                           <value>0x00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHANNEL0</name>
                           <description>The Event System user is connected to Channel 0</description>
                           <value>0x01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHANNEL1</name>
                           <description>The Event System user is connected to Channel 1</description>
                           <value>0x02</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHANNEL2</name>
                           <description>The Event System user is connected to Channel 2</description>
                           <value>0x03</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHANNEL3</name>
                           <description>The Event System user is connected to Channel 3</description>
                           <value>0x04</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
